{"data":{"markdownRemark":{"html":"<h3>Individual Accomplishments</h3>\n<p><a href=\"https://github.com/Lambda-School-Labs/labs9-family-tabs/pulse\">Github contribution graph.</a></p>\n<p>This week we set up our relational database. I had a lot to do with the implementation and execution of that task. We also layed out the skeleton for our front end with a navigation bar to connect the various components. I used my whiteboard a lot to visualize the data and MS Paint to share my ideas with the group. We have a live zoom open all day and utilize a lot of pair programming. I was able to share my knowledge with the group and give them refreshers on some aspects of both front end and back end that they haven't worked with in a while. </p>\n<h3>Proof of Progress</h3>\n<p><a href=\"https://github.com/Lambda-School-Labs/labs9-family-tabs/pull/18\">Github Front end Commit #1: The Skeleton</a> -\n<a href=\"https://trello.com/c/9fL2S4nc/27-front-end-skeleton\">Corresponding Trello</a> </p>\n<p><a href=\"https://github.com/Lambda-School-Labs/labs9-family-tabs/pull/15\">Github Front end Commit #2: The Reset</a> -\n<a href=\"https://trello.com/c/a1MdGMQ4/29-base-level-styling\">Corresponding Trello</a> </p>\n<p><a href=\"https://github.com/Lambda-School-Labs/labs9-family-tabs/pull/18\">Github Back end Commit #1: The Database</a> -\n<a href=\"https://trello.com/c/I8NOr9am/24-database\">Corresponding Trello</a><br>\n<strong><em><a href=\"https://imgur.com/a/PyOE5UP\">Screenshot album with reflections</a></em></strong></p>\n<p><a href=\"https://github.com/Lambda-School-Labs/labs9-family-tabs/pull/14\">Github Back end Commit #2: The Calendar Endpoint</a> -\n<a href=\"https://trello.com/c/cRf3fmgA/30-calendar-pull-endpoint\">Corresponding Trello</a></p>\n<h3>Milestone Reflections</h3>\n<p><strong><em>How the team came together.</em></strong></p>\n<p>I was bumped from the team I had signed up for. That group contained a few developers I knew and who's work I had seen. I was thrown into a team of unknown entities on a project that wasn't the least bit appealing to me. I thought I was screwed. I thought the my time at Lambda would culminate in a project I couldn't be proud of due to a random roll-of-the-dice intended to make things fair for everyone except me.</p>\n<p>Then I got over it. I spoke to the team, and it turns out nobody was a fan of the original idea. So we changed it. It took a little back and forth with administration, but everybody contributed to our new concept and by picking our battles, we were able to come to a compromise we could work with.</p>\n<p><strong><em>Laying the foundation.</em></strong></p>\n<p>When it came down to getting to the actual work, it became apparent that I was the most comfortable creating web applications. The rest of the team had been off in Computer Science or working as a full time Project Manager/Student Lead. I am fresh out of Fullstack. As a result, I have taken on the role of the catch all problem solver.</p>\n<p>By utilizing a persistent zoom channel and a focus on pair and mob programming, I am not only able to insure that we don't get stuck on a simple problem, I am able to refresh my team on concepts that they haven't touched in months. We take turns on the keyboard and we pause for questions. By defining the issue and overviewing my best solution, I am empowering the rest of the team to be more independent in future weeks.</p>\n<p>One thing I am concerned about is letting production bottleneck at me. I want everyone to be able to contribute equally. I can only hope that in taking the point on bringing the team back up to speed and taking on a little extra work hasn't rubbed anybody the wrong way. </p>","frontmatter":{"path":"/week-two-labs","title":"Labs 9 Week Two Wrap up","author":"Ryan Clausen","date":"Jan 17 2019"}}},"pageContext":{}}